from aiogram import types
from aiogram.utils import markdown



def generate_start_text(msg: types.Message) -> str:
    start_text = markdown.text(
        f'Приветствую, {markdown.hbold(msg.from_user.full_name)}! 👋',
        f'Данный бот предназначен для получения сообщений от пользователя через веб-сервис {markdown.hbold('Notification Hub')}.',
        f'Никакого другого взаимодействия с ботом {markdown.hunderline('не предусмотрено')}.',
        sep='\n'
    )

    return start_text


def generate_help_text() -> str:
    help_text = markdown.text(
        'Как это работает:',
        f'Пользователь через веб-сервис {markdown.hbold('Notification Hub')} вводит данные получателя (username в Telegram).',
        f'Сообщение отправится получателю только в том случае, если последний {markdown.hbold('запустил бота')} (политика Telegram)',
        f'Если получатель запустил бота, то ему {markdown.hunderline('придет сообщение')} от пользователя.',
        sep='\n'
    )

    return help_text


internal_error_text = "Произошла неизвестная ошибка. Повторите попытку позже. ❌"